pkg/wsman/wsmantesting/responses/ips/alarmclock/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/ips-schema/1/IPS_AlarmClockOccurrence"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>14</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-0000000032FB</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/ips-schema/1/IPS_AlarmClockOccurrence</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:IPS_AlarmClockOccurrence>
            <g:ElementName>testalarm</g:ElementName>
            <g:InstanceID>testalarm</g:InstanceID>
            <g:StartTime>testdatetime</g:StartTime>
            <g:Interval>0</g:Interval>
            <g:DeleteOnCompletion>true</g:DeleteOnCompletion>
        </g:IPS_AlarmClockOccurrence>
    </a:Body>
</a:Envelope>